&НаКлиенте
Функция ПолучитьКуки(Исходник)
	МассивСтрок = СтрРазделить(Исходник,";",Ложь);
	ПервыйКусок = МассивСтрок[0];
	ВторойКусок = "";
	ТретийКусок = "";
	//
	Для Каждого Стр Из МассивСтрок Цикл
		Если СтрНайти(Стр,"slrememberme") <> 0 Тогда
			ВторойКусок = Стр;
		КонецЕсли;
		//
		Если СтрНайти(Стр,"userId") <> 0 Тогда
			ТретийКусок = Стр;
		КонецЕсли;
	КонецЦикла;
	//
	Если СтрНайти(ВторойКусок,",") <> 0 Тогда
		МассивСтрок = СтрРазделить(ВторойКусок,",",Ложь);
		Для Каждого Стр Из МассивСтрок Цикл
			Если СтрНайти(Стр,"slrememberme") <> 0 Тогда
				ВторойКусок = Стр;
			КонецЕсли
		КонецЦикла;
	КонецЕсли;
	//
	Если СтрНайти(ТретийКусок,",") <> 0 Тогда
		МассивСтрок = СтрРазделить(ТретийКусок,",",Ложь);
		Для Каждого Стр Из МассивСтрок Цикл
			Если СтрНайти(Стр,"userId") <> 0 Тогда
				ТретийКусок = Стр;
			КонецЕсли
		КонецЦикла;
	КонецЕсли;
	//
	ПервыйКусок = СтрЗаменить(ПервыйКусок," ","");
	ВторойКусок = СтрЗаменить(ВторойКусок," ","");
	ТретийКусок = СтрЗаменить(ТретийКусок," ","");
	//
	КукиСтрока = ПервыйКусок + "; " + ВторойКусок + "; " + ТретийКусок;
	Возврат КукиСтрока;
КонецФункции

&НаКлиенте
Процедура ПолучитьТокен(Команда)
	Хост = "api.kwork.ru";
	Метод = "signIn?login="+Объект.Логин+"&password="+Объект.Пароль;
	//
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization","Basic bW9iaWxlX2FwaTpxRnZmUmw3dw==");
	//
	ЗС = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(Хост,,,,,,ЗС);
	HTTPЗапрос = Новый HTTPЗапрос(Метод,Заголовки);
	Результат = HTTPСоединение.ВызватьHTTPМетод("POST",HTTPЗапрос);
	ЗаголовкиОтвета = Результат.Заголовки;
	Куки = ПолучитьКуки(ЗаголовкиОтвета.Получить("set-cookie"));
	Ответ = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ);
	Данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Объект.Токен = Данные.response.token;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДиалоги(Команда)
	Хост = "api.kwork.ru";
	Метод = "dialogs";
	//
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Cookie",Куки);
	Заголовки.Вставить("Authorization","Basic bW9iaWxlX2FwaTpxRnZmUmw3dw==");
	Заголовки.Вставить("Token",Объект.Токен);
	Заголовки.Вставить("filter","all");
	//
	ЗС = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(Хост,,,,,,ЗС);
	HTTPЗапрос = Новый HTTPЗапрос(Метод,Заголовки);
	Результат = HTTPСоединение.ВызватьHTTPМетод("POST",HTTPЗапрос);
	ЗаголовкиОтвета = Результат.Заголовки;
	Ответ = Результат.ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПрофиль(Команда)
	Хост = "api.kwork.ru";
	Метод = "actor";
	//
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Cookie",Куки);
	Заголовки.Вставить("Authorization","Basic bW9iaWxlX2FwaTpxRnZmUmw3dw==");
	Заголовки.Вставить("Token",Объект.Токен);
	//
	ЗС = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(Хост,,,,,,ЗС);
	HTTPЗапрос = Новый HTTPЗапрос(Метод,Заголовки);
	Результат = HTTPСоединение.ВызватьHTTPМетод("POST",HTTPЗапрос);
	ЗаголовкиОтвета = Результат.Заголовки;
	Ответ = Результат.ПолучитьТелоКакСтроку();
КонецПроцедуры
